****Rivan CCNA Training Static and Default Route Routing P1****
Minimum Skills for a Network Engineer: Routing and Switching
1. Static Routing - minimum wage
2. EIGRP routing - 20k - 35k
3. OSPF routing
4. BGP routing
5. mBGP/VRF/VRFlite/VPN
6. MachoDancer

TASK1: static and default routing on P1/P2:

@P1
config t
int e0/0
 ip add 10.2.1.101 255.255.255.0
 no shut
end

@P2
config t
int e1/0
 ip add 10.2.1.102 255.255.255.0
 no shut
end

TWO RULES OF ROUTING:
Rule1: Ping Dikit: only direct neighbors ping/connect
  (devices will ping if same wire or VLAN)
sh vlan brief (A1/A2)
Rule 2: to PING NOT DIKIT: you need routing!!!!

Task1: ***configure static routing on P1:***

D1#show ip route connected | inc C
Codes: L - local, C - connected, S - static, R - RIP, M - mobile, B - BGP
C        10.1.4.4/30 is directly connected, Ethernet1/1
C        10.2.1.0/24 is directly connected, Vlan10
C        10.2.2.0/24 is directly connected, Vlan20
C        192.168.1.128/27 is directly connected, Vlan200

@P1
config t
ip route 10.1.4.4 255.255.255.252 10.2.1.1
ip route 10.2.2.0 255.255.255.0 10.2.1.1
ip route 192.168.1.128 255.255.255.224 10.2.1.1
!defaultIProuteP1
ip route 0.0.0.0 0.0.0.0 10.2.1.1
end
       ***configure Default route on P2:***
@P2
config t
ip route 0.0.0.0 0.0.0.0 10.2.1.2
end

show alias
  h                     help
  lo                    logout
  p                     ping
  r                     resume
  s                     show
  u                     undebug
  un                    undebug
  w                     where
  bp                    show ip int brief | ex una
  sr                    show ip route
  cn                    show cdp nei
  sp                    show ip protocols

Task2: ***configure 64bit EIGRP on D1/D2: CCNP and 32bit on R4: CCNA***
how to configure EIGRP:
route the networks:

D1#show ip route connected | inc C
Codes: L - local, C - connected, S - static, R - RIP, M - mobile, B - BGP
C        10.1.4.4/30 is directly connected, Ethernet1/1
C        10.2.1.0/24 is directly connected, Vlan10
C        10.2.2.0/24 is directly connected, Vlan20
C        192.168.1.128/27 is directly connected, Vlan200

@D1:
config t
router eigrp biteigrp
 address-family ipv4 unicast autonomous-system 100
  network 10.1.4.4 0.0.0.3
  network 10.2.1.0 0.0.0.255
  network 10.2.2.0 0.0.0.255
  network 192.168.1.128 0.0.0.31
 end

D2#show ip route connected | inc C
Codes: L - local, C - connected, S - static, R - RIP, M - mobile, B - BGP
C        10.1.4.8/30 is directly connected, Ethernet1/1
C        10.2.1.0/24 is directly connected, Vlan10
C        10.2.2.0/24 is directly connected, Vlan20
C        192.168.1.128/27 is directly connected, Vlan200

@D2
config t
router eigrp biteigrp
 address-family ipv4 unicast autonomous-system 100
  network 10.1.4.8 0.0.0.3
  network 10.2.1.0 0.0.0.255
  network 10.2.2.0 0.0.0.255
  network 192.168.1.128 0.0.0.31
 end

R4: 32bit (CCNA)

R4#sh ip route connected | inc C
Codes: L - local, C - connected, S - static, R - RIP, M - mobile, B - BGP
C        10.1.1.8/30 is directly connected, Ethernet1/2
C        10.1.4.4/30 is directly connected, Ethernet1/0
C        10.1.4.8/30 is directly connected, Ethernet1/1

@R4
config t
router eigrp 100
no auto-summary
 network 10.1.4.4 0.0.0.3
 network 10.1.4.8 0.0.0.3
end

how to check if EIGRP is running:
show ip eigrp ?
show ip eigrp traffic
show ip eigrp topology
show ip route eigrp
show ip protocols

R4#show ip eigrp neighbors
EIGRP-IPv4 Neighbors for AS(100)
H   Address                 Interface              Hold Uptime   SRTT   RTO  Q  Seq
                                                   (sec)         (ms)       Cnt Num
1   10.1.4.6                Et1/0                    11 00:10:04 1603  5000  0  13
0   10.1.4.10               Et1/1                    11 00:10:04    1   100  0  13

Task3: OPEN SHORTEST PATH FIRST PROTOCOL: The most support protocol in routers: cisco, juniper, huawei, fortinet, etc...

1. Create your Areas: = 0 backbone:

R4#sh ip route connected | inc C
Codes: L - local, C - connected, S - static, R - RIP, M - mobile, B - BGP
* C        10.1.1.8/30 is directly connected, Ethernet1/2
C        10.1.4.4/30 is directly connected, Ethernet1/0
C        10.1.4.8/30 is directly connected, Ethernet1/1

R3#sh ip route connected | inc C
Codes: L - local, C - connected, S - static, R - RIP, M - mobile, B - BGP
* C        10.1.1.4/30 is directly connected, Ethernet1/1
* C        10.1.1.8/30 is directly connected, Ethernet1/2

R2#sh ip route connected | inc C
Codes: L - local, C - connected, S - static, R - RIP, M - mobile, B - BGP
* C        10.1.1.0/30 is directly connected, Ethernet1/2
* C        10.1.1.4/30 is directly connected, Ethernet1/1

R1#sh ip route connected | inc C
Codes: L - local, C - connected, S - static, R - RIP, M - mobile, B - BGP
* C        10.1.1.0/30 is directly connected, Ethernet1/0
C        207.7.7.0/24 is directly connected, Ethernet1/2
C        208.8.8.0/24 is directly connected, Ethernet1/1
C        209.9.9.0/24 is directly connected, Ethernet1/3

@R4
config t
int lo0
 ip add 4.4.4.4 255.255.255.255
router ospf 1
router-id 4.4.4.4
network 10.1.1.8 0.0.0.3 area 34
end

@R3
config t
int lo0
 ip add 3.3.3.3 255.255.255.255
router ospf 1
router-id 3.3.3.3
network 10.1.1.8 0.0.0.3 area 34
network 10.1.1.4 0.0.0.3 area 0
end

@R2
config t
int lo0
 ip add 2.2.2.2 255.255.255.255
router ospf 1
router-id 2.2.2.2
network 10.1.1.4 0.0.0.3 area 0
network 10.1.1.0 0.0.0.3 area 12
end

@R1
config t
int lo0
 ip add 1.1.1.1 255.255.255.255
router ospf 1
router-id 1.1.1.1
network 10.1.1.0 0.0.0.3 area 12
end

clear ip ospf process

How to check if OSPF is working:
show ip protocols
show ip ospf database
show ip ospf neighbor
show ip route ospf

Task4: Configure EBGP for R1 and isp1,isp2,isp3:

R1#bp
Interface                  IP-Address      OK? Method Status                Protocol
Ethernet1/0                10.1.1.1        YES NVRAM  up                    up      
Ethernet1/1                208.8.8.1       YES NVRAM  up                    up      
Ethernet1/2                207.7.7.1       YES NVRAM  up                    up      
Ethernet1/3                209.9.9.1       YES NVRAM  up                    up      
Loopback0                  1.1.1.1         YES manual up                    up      

@R1 BGP:
config t
router bgp 1
 bgp log-neighbor-changes
 neighbor 208.8.8.4 remote-as 45
 neighbor 207.7.7.2 remote-as 2
 neighbor 209.9.9.3 remote-as 3
 network 10.0.0.0 Mask 255.255.255.252
 network 207.7.7.0 Mask 255.255.255.0
 network 208.8.8.0 Mask 255.255.255.0
 network 209.9.9.0 Mask 255.255.255.0
end

ISP1#sh ip route connected | inc C
Codes: L - local, C - connected, S - static, R - RIP, M - mobile, B - BGP
C        24.2.4.0/24 is directly connected, Ethernet1/1
C        44.44.44.44 is directly connected, Loopback0
C        45.4.5.0/24 is directly connected, Ethernet1/2
C        208.8.8.0/24 is directly connected, Ethernet1/3
@ISP1 BGP:
config t
router bgp 45
 bgp log-neighbor-changes
 neighbor 24.2.4.2 remote-as 2
 neighbor 45.4.5.5 remote-as 45
 neighbor 208.8.8.1 remote-as 1
 network 24.2.4.0 Mask 255.255.255.0
 network 44.44.44.44 Mask 255.255.255.255
 network 45.4.5.0 Mask 255.255.255.0
 network 208.8.8.0 Mask 255.255.255.0
 !pretendtobeaREAL ISP:
 network 0.0.0.0
 ip route 0.0.0.0 0.0.0.0 null 0
 ip route 10.0.0.0 255.0.0.0 208.8.8.1
end

ISP2#sh ip route connected | inc C
Codes: L - local, C - connected, S - static, R - RIP, M - mobile, B - BGP
C        22.22.22.22 is directly connected, Loopback0
C        24.2.4.0/24 is directly connected, Ethernet1/1
C        25.2.5.0/24 is directly connected, Ethernet0/2
C        32.3.2.0/24 is directly connected, Ethernet1/2
C        207.7.7.0/24 is directly connected, Ethernet1/3

@ISP2 BGP:
config t
router bgp 2
 bgp log-neighbor-changes
 neighbor 24.2.4.4 remote-as 45
 neighbor 25.2.5.5 remote-as 45
 neighbor 32.3.2.3 remote-as 3
 neighbor 207.7.7.1 remote-as 1
 network 207.7.7.0
 network 24.2.4.0 Mask 255.255.255.0
 network 22.22.22.22 Mask 255.255.255.255
 network 25.2.5.0 Mask 255.255.255.0
 network 32.3.2.0 Mask 255.255.255.0
 !fakeInternet
 network 0.0.0.0
 ip route 0.0.0.0 0.0.0.0 null 0
 ip route 10.0.0.0 255.0.0.0 207.7.7.1
end

ISP3#sh ip route connected | inc C
Codes: L - local, C - connected, S - static, R - RIP, M - mobile, B - BGP
C        32.3.2.0/24 is directly connected, Ethernet1/2
C        33.33.33.33 is directly connected, Loopback0
C        35.3.5.0/24 is directly connected, Ethernet1/1
C        209.9.9.0/24 is directly connected, Ethernet1/3

@ISP3 BGP:
config t
router bgp 3
 bgp log-neighbor-changes
 neighbor 32.3.2.2 remote-as 2
 neighbor 35.3.5.5 remote-as 45
 neighbor 209.9.9.1 remote-as 1
 network 209.9.9.0
 network 32.3.2.0 Mask 255.255.255.0
 network 33.33.33.33 Mask 255.255.255.255
 network 35.3.5.0 Mask 255.255.255.0
 network 0.0.0.0
 ip route 0.0.0.0 0.0.0.0 null 0
 ip route 10.0.0.0 255.0.0.0 209.9.9.1
end

ISP4#sh ip route connected | inc C
Codes: L - local, C - connected, S - static, R - RIP, M - mobile, B - BGP
C        25.2.5.0/24 is directly connected, Ethernet0/2
C        35.3.5.0/24 is directly connected, Ethernet0/3
C        45.4.5.0/24 is directly connected, Ethernet0/1
C        55.55.55.55 is directly connected, Loopback0

@ISP4 BGP:
config t
int lo 8
 ip add 8.8.8.8 255.255.255.255
router bgp 45
 bgp log-neighbor-changes
 neighbor 25.2.5.2 remote-as 2
 neighbor 45.4.5.4 remote-as 45
 neighbor 35.3.5.3 remote-as 3
 network 8.8.8.8 Mask 255.255.255.255
 network 25.2.5.0 Mask 255.255.255.0
 network 35.3.5.0 Mask 255.255.255.0
 network 45.4.5.0 Mask 255.255.255.0
 network 55.55.55.55 Mask 255.255.255.255
end

show ip bgp summary
show ip bgp neighbor
show ip route bgp

Task5: how to comunicate eigrp,ospf,bgp
r4#sh ip route ospf
O IA
O IA
R1#
config t
router ospf 1
default-information originate

R4#sh ip route os
O*E2
O IA
O IA

you can now ping 8.8.8.8 from R4
traceroute 8.8.8.8 from R4

2 way route redistribution

R4#
sh int e1/0

"MTU 1500 bytes, BW 10000 kbit/sec, DLY 1000 sec, reliability 255/255, txload 1/255, rxload 1/255"-you need this

config t
router eigrp 100
redistribute ospf 1 metric 10000(BW) 100 (DLY less 1 zero) 255(reliability) 1(loading) 1500(MTU)
"all ospf route will get inside eigrp"

D1#sh ip route eigrp
D*EX
D EX
D

R3#sh ip route ospf
O*E2
O IA

R4#
config t
router ospf 1
redistribute eigrp 100 SUBnets
end

R3#sh ip route ospf
O*E2
O IA
O E2
O E2

P1#
***default route***
config t
 ip route 0.0.0.0 0.0.0.0 10.2.1.1
end

show ip route 
S*  0.0.0.0/0 [1/0] via 10.2.1.1

ping 8.8.8.8
traceroute 8.8.8.8

P2#
ping 8.8.8.8
traceroute 8.8.8.8
